tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'thoughtbot/formulae'
# Cross-platform make
brew 'cmake'
# GNU File, Shell, and Text utilities
brew 'coreutils'
# Reimplementation of ctags(1)
brew 'ctags'
# Command-line fuzzy finder written in Go
brew 'fzf'
# Distributed revision control system
brew 'git'
# Library for command-line editing
brew 'readline'
# Command-line interface for SQLite
brew 'sqlite'
# Interpreted, interactive, object-oriented programming language
brew 'python'
# Core application library for C
brew 'glib'
# GNU Pretty Good Privacy (PGP) package
brew 'gnupg'
# Add GitHub support to git on the command-line
brew 'gh'
# Database of common MIME types
brew 'shared-mime-info'
# Tools and libraries to manipulate images in many formats
brew 'imagemagick'
# Ambitious Vim-fork focused on extensibility and agility
brew 'neovim'
# Terminal multiplexer
brew 'tmux'
# Process manager for Procfile-based applications and tmux
brew 'overmind'
# Object-relational database system
brew 'postgresql@14', restart_service: true, link: true
# Persistent key-value database, with built-in net interface
brew 'redis'
# Search tool like grep and The Silver Searcher
brew 'ripgrep'
# management suite for dotfiles
brew 'thoughtbot/formulae/rcm'
